app/views/profiles/show.html.erb

      <div>
        <p class="text-2xl font-bold text-blue-400"><%= @user.workouts.completed.count %></p>
---
SELECT "workouts".* FROM "workouts" WHERE "workouts"."user_id" = ? AND "workouts"."id" = ? LIMIT ?  [["user_id", 980190962], ["id", 739067224], ["LIMIT", 1]]

      <div>
        <p class="text-2xl font-bold text-blue-400"><%= @user.runs.count %></p>
---
SELECT COUNT(*) FROM "runs" WHERE "runs"."user_id" = 2