app/views/workouts/index.html.erb

        &middot; <%= @current_workout.location&.humanize %>
        <% if @current_workout.workout_exercises.any? %>
          &middot; <%= @current_workout.workout_exercises.count %> exercises
---
SELECT 1 AS one FROM "workout_exercises" WHERE "workout_exercises"."workout_id" = 1 LIMIT 1
SELECT COUNT(*) FROM "workout_exercises" WHERE "workout_exercises"."workout_id" = 1