app/views/workouts/show.html.erb


  <% if @workout.planned? && @workout.workout_exercises.empty? %>
---
SELECT COUNT(*) FROM "workouts"
SELECT 1 AS one FROM "workout_exercises" WHERE "workout_exercises"."workout_id" = 1 LIMIT 1


  <% if @workout.workout_exercises.any? && !@workout.completed? %>
---
SELECT 1 AS one FROM "workout_exercises" WHERE "workout_exercises"."workout_id" = 1 LIMIT 1