app/models/concerns/rp_periodization.rb

  def initialize_volumes!
    MuscleGroup.find_each do |mg|
      mesocycle_volumes.create!(
        muscle_group: mg,
        starting_sets: mg.default_mev,
        current_sets: mg.default_mev,
        mev: mg.default_mev,
        mav: ((mg.default_mev + mg.default_mrv) / 2.0).round,
        mrv: mg.default_mrv
      )
---
SELECT "muscle_groups".* FROM "muscle_groups" ORDER BY "muscle_groups"."id" ASC LIMIT 1000
INSERT INTO "mesocycle_volumes" ("mesocycle_id", "muscle_group_id", "starting_sets", "current_sets", "mev", "mav", "mrv", "created_at", "updated_at") VALUES (1, 1, 8, 8, 8, 15, 22, '2026-02-13 23:00:06.278600', '2026-02-13 23:00:06.278600') RETURNING "id"

  def volume_summary
    mesocycle_volumes.includes(:muscle_group).map do |mv|
---
SELECT "muscle_groups".* FROM "muscle_groups" WHERE "muscle_groups"."id" IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14)