app/models/workout/generator.rb

INSERT INTO "chats" ("created_at", "updated_at", "model_id", "user_id") VALUES ('2026-02-13 23:01:04.715491', '2026-02-13 23:01:04.715491', 21, 2) RETURNING "id"
---
  def create_chat
    chat = user.chats.create!(model: user.default_provider_model)

SELECT "muscle_groups".* FROM "muscle_groups" WHERE "muscle_groups"."id" IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14)
---
  def user_prompt
    mesocycle = workout.mesocycle
    location = workout.location

    prompt = "Generate a #{location} workout for today. "

    if mesocycle
      prompt += "This is week #{mesocycle.current_week} of #{mesocycle.duration_weeks} in a #{mesocycle.split_type.humanize} mesocycle. "
      prompt += "Target RIR: #{mesocycle.target_rir}. "

      volumes = mesocycle.volume_summary
      if volumes.any?
        prompt += "\nVolume targets this week:\n"
        volumes.each do |v|
          prompt += "- #{v[:muscle_group]}: #{v[:week_volume]} sets (MEV: #{v[:mev]}, MRV: #{v[:mrv]})\n"
        end
      end
    end

    # Add available exercises for this location
    available = Exercise.for_location(location).includes(:muscle_group).group_by { |e| e.muscle_group.name }

SELECT "exercises".* FROM "exercises" WHERE "exercises"."name" = 'Barbell Back Squat' LIMIT 1
INSERT INTO "workout_exercises" ("workout_id", "exercise_id", "position", "target_sets", "target_reps", "target_rir", "notes", "created_at", "updated_at") VALUES (1, 26, 1, 3, '8-12', 3, 'Keep chest up, break at hips and knees simultaneously. Control descent, drive through heels. Start conservative to establish baseline.', '2026-02-13 23:01:23.106187', '2026-02-13 23:01:23.106187') RETURNING "id"
---
  def parse_and_create_exercises(content)
    json = extract_json(content)
    data = JSON.parse(json)
    exercises_data = data.is_a?(Hash) ? data["exercises"] : data

    exercises_data.each_with_index do |ex_data, index|
      exercise = Exercise.find_by(name: ex_data["name"])
      next unless exercise

      workout.workout_exercises.create!(
        exercise: exercise,
        position: index + 1,
        target_sets: ex_data["sets"] || 3,
        target_reps: ex_data["reps"] || "8-12",
        target_rir: ex_data["rir"],
        notes: ex_data["notes"]
      )