app/controllers/exercise_sets_controller.rb

UPDATE "workouts" SET "status" = 1, "updated_at" = '2026-02-13 23:02:58.082759' WHERE "workouts"."id" = 1
INSERT INTO "exercise_sets" ("workout_exercise_id", "set_number", "reps", "weight", "rir", "completed", "notes", "created_at", "updated_at") VALUES (1, 1, 10, 175.0, 3, TRUE, NULL, '2026-02-13 23:02:58.088023', '2026-02-13 23:02:58.088023') RETURNING "id"
---
  def create
    @exercise_set = @workout_exercise.exercise_sets.new(exercise_set_params)
    @exercise_set.set_number = @workout_exercise.next_set_number

    @workout.update(status: :in_progress) if @workout.planned?

    if @exercise_set.save

DELETE FROM "exercise_sets";
---
  def destroy
    @exercise_set.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
SELECT "workouts".* FROM "workouts" WHERE "workouts"."user_id" = 2 AND "workouts"."id" = 1 LIMIT 1
SELECT "exercises".* FROM "exercises" WHERE "exercises"."id" = ? LIMIT ?  [["id", 542351184], ["LIMIT", 1]]
SELECT "workout_exercises".* FROM "workout_exercises" WHERE "workout_exercises"."id" = ? LIMIT ?  [["id", 650076730], ["LIMIT", 1]]
---
  def set_workout_and_exercise
    @workout = Current.user.workouts.find(params[:workout_id])
    @workout_exercise = @workout.workout_exercises.find(params[:workout_exercise_id])

SELECT "exercise_sets".* FROM "exercise_sets" WHERE "exercise_sets"."id" = ? LIMIT ?  [["id", 491626579], ["LIMIT", 1]]
---
  def set_exercise_set
    @exercise_set = @workout_exercise.exercise_sets.find(params[:id])