app/controllers/mesocycles_controller.rb

  def index
    @mesocycles = Current.user.mesocycles.order(created_at: :desc)
---
SELECT "mesocycles".* FROM "mesocycles" WHERE "mesocycles"."user_id" = ? ORDER BY "mesocycles"."created_at" DESC  [["user_id", 980190962]]

  def create
    @mesocycle = Current.user.mesocycles.new(mesocycle_params)

    if @mesocycle.save
---
INSERT INTO "mesocycles" ("user_id", "start_date", "end_date", "duration_weeks", "current_week", "status", "split_type", "notes", "created_at", "updated_at") VALUES (2, '2026-02-13', '2026-03-13', 4, 1, 0, 'full_body', 'Keep muscle and drop some fat.', '2026-02-13 23:00:06.250847', '2026-02-13 23:00:06.250847') RETURNING "id"

  def complete
    @mesocycle.update!(status: :completed)
---
UPDATE "mesocycles" SET "current_week" = ?, "updated_at" = ? WHERE "mesocycles"."id" = ?  [["current_week", 2], ["updated_at", "2026-02-13 22:47:20.031999"], ["id", 186579971]]

  def set_mesocycle
    @mesocycle = Current.user.mesocycles.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
SELECT "mesocycles".* FROM "mesocycles" WHERE "mesocycles"."user_id" = 2 AND "mesocycles"."id" = 1 LIMIT 1