app/controllers/profiles_controller.rb

  def update
    @user = Current.user
    if @user.update(profile_params)
---
UPDATE "users" SET "default_provider" = ?, "training_experience" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["default_provider", "xai"], ["training_experience", 2], ["updated_at", "2026-02-14 00:09:41.422956"], ["id", 980190962]]