app/controllers/runs_controller.rb

  def create
    @run = Current.user.runs.new(run_params)

    if @run.save
---
INSERT INTO "runs" ("created_at", "date", "distance", "duration_minutes", "notes", "pace", "run_type", "updated_at", "user_id", "workout_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    if @run.update(run_params)
---
UPDATE "runs" SET "distance" = ?, "updated_at" = ? WHERE "runs"."id" = ?  [["distance", 4.0], ["updated_at", "2026-02-14 00:11:27.169144"], ["id", 365275410]]

  def destroy
    @run.destroy
---
DELETE FROM "runs" WHERE "runs"."id" = ?  [["id", 365275410]]

  def set_run
    @run = Current.user.runs.find(params[:id])
---
SELECT "runs".* FROM "runs" WHERE "runs"."user_id" = ? AND "runs"."id" = ? LIMIT ?  [["user_id", 980190962], ["id", 365275410], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]