app/controllers/workouts_controller.rb

  def index
    @current_workout = Current.user.workouts.where(status: [ :planned, :in_progress, :generating ]).order(created_at: :desc).first
---
SELECT "workouts".* FROM "workouts" WHERE "workouts"."user_id" = 2 AND "workouts"."status" IN (0, 1) ORDER BY "workouts"."created_at" DESC LIMIT 1

  def show
    @workout_exercises = @workout.workout_exercises.includes(:exercise, :exercise_sets)
---
SELECT "exercises".* FROM "exercises" WHERE "exercises"."id" IN (?, ?)  [["id", 542351184], ["id", 65321948]]

  def new
    if active_workout = Current.user.workouts.where(status: [ :planned, :in_progress, :generating ]).first
---
SELECT "workouts".* FROM "workouts" WHERE "workouts"."user_id" = ? AND "workouts"."status" IN (?, ?, ?) ORDER BY "workouts"."created_at" DESC LIMIT ?  [["user_id", 980190962], ["status", 0], ["status", 1], ["status", 3], ["LIMIT", 1]]

  def create
    if active_workout = Current.user.workouts.where(status: [ :planned, :in_progress, :generating ]).first
      redirect_to workouts_path, alert: "You already have an active workout."
      return
    end
    @workout = Current.user.workouts.new(workout_params)
    @workout.date ||= Date.current
    @workout.status = :planned

    if @active_mesocycle = Current.user.active_mesocycle
      @workout.mesocycle = @active_mesocycle
      @workout.week_number = @active_mesocycle.current_week
    end

    if @workout.save
---
INSERT INTO "workouts" ("user_id", "mesocycle_id", "workout_type", "location", "date", "status", "week_number", "notes", "created_at", "updated_at") VALUES (2, 1, 0, 1, '2026-02-13', 0, 1, NULL, '2026-02-13 23:00:25.953679', '2026-02-13 23:00:25.953679') RETURNING "id"

  def destroy
    @workout.destroy
---
DELETE FROM "workouts" WHERE "workouts"."id" = ?  [["id", 739067224]]

  def generate
    @workout.update!(status: :generating, generation_error: nil)
---
UPDATE "workouts" SET "status" = ?, "updated_at" = ? WHERE "workouts"."id" = ?  [["status", 3], ["updated_at", "2026-02-14 00:10:07.662070"], ["id", 739067224]]

  def set_workout
    @workout = Current.user.workouts.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
SELECT "workouts".* FROM "workouts" WHERE "workouts"."user_id" = 2 AND "workouts"."id" = 1 LIMIT 1